clc; close; clear;
m1 = 'буревестник';
c=encrypt(m1);
disp(char(c));
m2=decrypt(c);
disp(char(m2));

function g = ctoiconv(s,n)
g = zeros(1,n);
    for i = 1:n
        if s(1,i) == 32
            g(1,i) = 34;
        end
        if s(1,i) == 1104
            g(1,i) = 7;
        end
        if s(1,i) == 44
            g(1,i) = 35;
        end
        if s(1,i) == 46
            g(1,i) = 36;
        end
        if s(1,i) > 1077 && s(1,i) < 1104
            g(1,i) = s(1,i)-1070;
        end
        if s(1,i) > 1071 && s(1,i) < 1078
            g(1,i) = s(1,i)-1071;
        end
    end
end

function g = chdig(s1,s2,n)
    g = zeros(1,n);
    for i = 1:2:n-1
        g(1,i)= (s1(i+1)-1)*6 + s2(i);
    end
    for i = 2:2:n
        g(1,i)= (s1(i-1)-1)*6 + s2(i);
    end
end

function g = encrypt(p)
    n = length(p);
    if mod(n,2) ~= 0
        s = [p ' '];
        n = n+1;
    else
        s = p;
    end
    s=ctoiconv(s,n);
    m1 = [5 1 18 20 34 3 6 11 27 7 12 16 30 33 15 25 10 19 9 2 21 4 24 22 13 8 14 17 23 26 28 29 31 32 35 36];
    m2 = [2 20 6 22 1 7 10 26 19 17 8 11 25 27 15 12 28 3 18 4 21 24 29 23 16 30 9 31 32 13 33 34 14 5 35 36];
    T = [1072 1073 1074 1075 1076 1077 1104 1078 1079 1080 1081 1082 1083 1084 1085 1086 1087 1088 1089 1090 1091 1092 1093 1094 1095 1096 1097 1098 1099 1100 1101 1102 1103 32 44 46];
    
    for i = 2:2:n
        s(1,i) = m2(1,s(1,i));
    end
    
    sx = mod(s-1,6)+1;
    sy = ceil(s/6);
    g = chdig(sy,sx,n);
    
    for i = 1:2:n-1
        g(1,i) = m1(1,g(1,i));
    end
    for i = 1:n
        g(1,i) = T(1,g(1,i));
    end
end

function g = decrypt(p)
    n = size(p);
    
    p=ctoiconv(p,n(1,2));
    m1 = [5 1 18 20 34 3 6 11 27 7 12 16 30 33 15 25 10 19 9 2 21 4 24 22 13 8 14 17 23 26 28 29 31 32 35 36];
    m2 = [2 20 6 22 1 7 10 26 19 17 8 11 25 27 15 12 28 3 18 4 21 24 29 23 16 30 9 31 32 13 33 34 14 5 35 36];
    T = [1072 1073 1074 1075 1076 1077 1104 1078 1079 1080 1081 1082 1083 1084 1085 1086 1087 1088 1089 1090 1091 1092 1093 1094 1095 1096 1097 1098 1099 1100 1101 1102 1103 32 44 46];
    
    for i = 1:2:n(1,2)-1
        p(1,i) = m2(1,p(1,i));
    end
    
    px = mod(p-1,6)+1;
    py = ceil(p/6);
    g = chdig(py,px,n(1,2));
    
    for i = 2:2:n(1,2)
        g(1,i) = m1(1,g(1,i));
    end
    for i = 1:n(1,2)
        g(1,i) = T(1,g(1,i));
    end
end

